import sys
input = sys.stdin.readline

# 입력 부분
n, m = map(int,input().split())
paper = [list(map(int,input().split())) for _ in range(n)]

# 모든 가능한 테트로미노는 19개 ( 대칭, 회전 포함 )
tetrominos = [ 
    [(0,0), (0,1), (1,0), (1,1)], # ㅁ
    [(0,0), (0,1), (0,2), (0,3)], # ㅡ
    [(0,0), (1,0), (2,0), (3,0)], # ㅣ
    [(0,0), (0,1), (0,2), (1,0)], 
    [(1,0), (1,1), (1,2), (0,2)],
    [(0,0), (1,0), (1,1), (1,2)], # ㄴ
    [(0,0), (0,1), (0,2), (1,2)], # ㄱ
    [(0,0), (1,0), (2,0), (2,1)],
    [(2,0), (2,1), (1,1), (0,1)],
    [(0,0), (0,1), (1,0), (2,0)], 
    [(0,0), (0,1), (1,1), (2,1)],
    [(0,0), (0,1), (0,2), (1,1)], # ㅜ
    [(1,0), (1,1), (1,2), (0,1)], # ㅗ
    [(0,0), (1,0), (2,0), (1,1)], # ㅏ
    [(1,0), (0,1), (1,1), (2,1)], # ㅓ
    [(1,0), (2,0), (0,1), (1,1)],
    [(0,0), (1,0), (1,1), (2,1)],
    [(1,0), (0,1), (1,1), (0,2)],
    [(0,0), (0,1), (1,1), (1,2)]
]

def count(x, y, t) :
    value = 0
    global n, m
    for dx, dy in t :
        nx = x + dx
        ny = y + dy
        if 0 <= nx < n and 0 <= ny < m :
            value += paper[nx][ny]
        else:
            return -1
    return value
 

ans = 0
for i in range(n):
    for j in range(m):
        for tetromino in tetrominos: # 총 19개의 테트로미노 탐색
            ans = max(ans, count(i, j, tetromino))
 
# edge-case : 19 (테트로미노 경우의 수) * 4 * 200 = 15200번 연산.
print(ans)